IDS_DGNCALCBASE_TEST = "DgnCalcBase-Test(ภาษา:EN)"
IDS_MESHPMCV_AUTOMESH_SectionData = "ข้อมูลหน้าตัดไม่เหมาะสมสำหรับการสร้าง Mesh"
IDS_MESHPMCV_AUTOMESH_MakeMesh = "ไม่สามารถสร้าง Auto-Mesh ได้"
IDS_MESHPMCV_AUTOMESH_Property = "ไม่สามารถคำนวณคุณสมบัติหน้าตัดของหน้าตัดที่ทำ Auto Mesh ได้"
IDS_MESHPMCV_PROPERTY_Area = "ไม่สามารถคำนวณคุณสมบัติหน้าตัด (  Cross section ) ได้"
IDS_MESHPMCV_PROPERTY_1stInertia = "ไม่สามารถคำนวณคุณสมบัติหน้าตัด ( โมเมนต์ความเฉื่อยอันดับที่ 1 ) ได้"
IDS_MESHPMCV_PROPERTY_2ndInertia = "ไม่สามารถคำนวณคุณสมบัติหน้าตัด ( โมเมนต์ความเฉื่อยอันดับที่ 2 ) ได้"
IDS_MESHPMCV_PROPERTY_PlasticCent = "ไม่สามารถคำนวณคุณสมบัติหน้าตัด ( Plastic centroid ) ได้"
IDS_MESHPMCV_MAKECURV_PMCvAngle = "มีข้อผิดพลาดในข้อมูลมุมพื้นฐานสำหรับการสร้างเส้นโค้ง PM"
IDS_MESHPMCV_MAKECURV_PMCvLine = "การสร้างเส้นโค้ง PM ล้มเหลว"
IDS_MESHPMCV_TUNECURV_LessLine = "เส้นโค้ง PM ที่ปรับอัตโนมัติมีค่าน้อยกว่าเส้นโค้ง PM เดิม"
IDS_MESHPMCV_CALRATIO_SelectLine = "มีข้อผิดพลาดในตัวเลือกเส้นโค้ง PM สำหรับการคำนวณกำลังออกแบบ"
IDS_MESHPMCV_CALRATIO_FindStrength = "ไม่สามารถคำนวณกำลังออกแบบได้"
IDS_MESHPMCV_CALRATIO_MakeCurve = "ไม่สามารถคำนวณเส้นโค้ง PM สำหรับกำลังออกแบบได้"
IDS_MESHPMCV_CALRATIO_OverIncAngle = "มุมเพิ่มมีขนาดใหญ่เกินไป"
IDS_MESHPMCV_CALRATIO_ForceSum = "ไม่สามารถคำนวณผลรวมของแรงได้"
IDS_GEO_DGNCALC_PILE_FDN = "ฐานรากเสาเข็ม"
IDS_GEO_DGNCALC_FOOT_FDN = "ฐานรากตรง"
IDS_GEO_DGNCALC_FDN_BEARING_REVIEW = "การตรวจสอบความสามารถรับน้ำหนัก"
IDS_GEO_DGNCALC_FDN_FRICTION_RESULT = "แรงเฉือนผิวลบ"
IDS_GEO_DGNCALC_FDN_SETTLE_RESULT = "การตรวจสอบการทรุดตัว"
IDS_GEO_DGNCALC_FDN_DIR_RESULT = "ความสามารถรับน้ำหนักด้านข้าง"
IDS_GEO_DGNCALC_FDN_DGN_STANDARD_2009 = "มาตรฐานการออกแบบฐานรากของโครงสร้าง (2009.3)"
IDS_GEO_DGNCALC_FDN_RAILBRIDGE_DGN_2004 = "มาตรฐานการออกแบบสะพานรถไฟ (2004)"
IDS_GEO_DGNCALC_FDN_BRIDGE_DGN_SPEC_2008 = "ข้อกำหนดการออกแบบสะพาน (2008)"
IDS_GEO_DGNCALC_FDN_TIP_BEARING = "ความสามารถรับน้ำหนักปลาย"
IDS_GEO_DGNCALC_FDN_FRICTION = "แรงเฉือนผิว"
IDS_GEO_DGNCALC_FDN_PILE_TYPE = "เสาเข็มขับ"
IDS_GEO_DGNCALC_FDN_DRILLED = "เสาเข็มหล่อในที่"
IDS_GEO_DGNCALC_FDN_PILE_PURCHASE = "เสาเข็มหลุมเจาะ"
IDS_GEO_DGNCALC_FDN_INTERVAL_PILE = "เสาเข็มเจาะ"
IDS_GEO_DGNCALC_FDN_STEEL = "เสาเข็มท่อเหล็ก"
IDS_GEO_DGNCALC_FDN_STATICS_REVIEW = "การตรวจสอบสถิติ"
IDS_GEO_DGNCALC_FDN_FIELD_TEST = "การทดสอบภาคสนาม"
IDS_GEO_DGNCALC_FDN_BEARING_ROCK_REVIEW = "การรับน้ำหนักของหิน"
IDS_GEO_DGNCALC_SAND = "ทราย"
IDS_GEO_DGNCALC_CLAY = "ดินเหนียว"
IDS_GEO_DGNCALC_ROCK = "หิน"
IDS_GEO_DGNCALC_FDN_SPT = "การทดสอบการเจาะมาตรฐาน"
IDS_GEO_DGNCALC_FDN_CPT = "การทดสอบการเจาะกรวยแบบสถิต (CPT)"
IDS_GEO_DGNCALC_FDN_PMT = "การทดสอบเครื่องวัดความดัน"
IDS_GEO_DGNCALC_FDN_PBT = "การทดสอบการรับน้ำหนักแผ่น"
IDS_GEO_DGNCALC_FDN_VST = "การทดสอบแรงเฉือนใบพัด"
IDS_GEO_DGNCALC_FDN_ROWE_ARMITAGE = "Rowe. et al"
IDS_GEO_DGNCALC_FDN_ZHANG_EINSTEIN = "Zhang. et al"
IDS_GEO_DGNCALC_FDN_CANADIAN_2006 = "ฐานรากแคนาดา (2006)"
IDS_GEO_DGNCALC_FDN_CANADIAN_1985 = "ฐานรากแคนาดา (1985)"
IDS_GEO_DGNCALC_FDN_NAVFAC_1982 = "NAVFAC(1982)"
IDS_GEO_DGNCALC_FDN_TOUMA_REESE_QUIROS = "Reese. et al"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1971 = "Meyerhof"
IDS_GEO_DGNCALC_FDN_MEYERHOF = "Meyerhof"
IDS_GEO_DGNCALC_FDN_TOUMA_REESE = "Touma. et al"
IDS_GEO_DGNCALC_FDN_QUIROS_REESE = "Qurios. et al"
IDS_GEO_DGNCALC_FDN_REESE_ONEILL = "Reese. et al"
IDS_GEO_DGNCALC_FDN_BASE_STANDARD = "มาตรฐานการออกแบบฐานรากโครงสร้าง"
IDS_GEO_DGNCALC_FDN_ASSHTO = "AASHTO"
IDS_GEO_DGNCALC_FDN_FHWA = "FHWA"
IDS_GEO_DGNCALC_FDN_DRAIN_CONSIDER = "พิจารณา c-Φ"
IDS_GEO_DGNCALC_FDN_ROCKSTRENTH_JOINT = "กำลังของหินและคุณสมบัติของรอยต่อ"
IDS_GEO_DGNCALC_FDN_LIMITE_COMPRESS = "การทดสอบน้ำหนักบรรทุกหลุมเจาะ"
IDS_GEO_DGNCALC_FDN_SPT_UNLIMITE = "การทดสอบการเจาะมาตรฐาน"
IDS_GEO_DGNCALC_FDN_CPT_UNLIMITE = "การทดสอบการเจาะกรวย"
IDS_GEO_DGNCALC_FDN_ROCKPILE_UNLIMITE = "เสาเข็มที่ขับลงในหิน"
IDS_GEO_DGNCALC_FDN_SAND_SPT = "ดินทราย - SPT"
IDS_GEO_DGNCALC_FDN_UNDRAIN_CLAY = "ดินเหนียว - วิธีปัจจัย α"
IDS_GEO_DGNCALC_FDN_EFFECT_STRESS = "ดินเหนียว - วิธีปัจจัย β"
IDS_GEO_DGNCALC_FDN_CLAY_FACTOR = "ดินเหนียว - วิธีปัจจัย λ"
IDS_GEO_DGNCALC_FDN_CONSTRUCT_DISTURB_CONSIDER = "การรบกวนของพื้นดิน"
IDS_GEO_DGNCALC_FDN_CLAY_LAYER = "ชั้นดินเหนียว"
IDS_GEO_DGNCALC_FDN_SAND_OFFER_TABLE = "พื้นดินทราย"
IDS_GEO_DGNCALC_FDN_CLAY_ALPHA = "ดินเหนียว - วิธีปัจจัย α"
IDS_GEO_DGNCALC_FDN_CLAY_SPT = "ดินเหนียว - SPT"
IDS_GEO_DGNCALC_FDN_CLAY_UNDRAIN = "ดินเหนียว - ความต้านทานไม่ระบายน้ำ"
IDS_GEO_DGNCALC_FDN_SAND_OFFER_FRICTION_TABLE = "พื้นดินทราย"
IDS_GEO_DGNCALC_FDN_USE_SPT = "การทดสอบการเจาะมาตรฐาน"
IDS_GEO_DGNCALC_FDN_ROCK_1988 = "หิน - Kulhawy"
IDS_GEO_DGNCALC_FDN_ROCK_1979 = "หิน - Kenney"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1976 = "สมการกำลังรับน้ำหนัก (Meyerhof,1976) ของดินทรายโดยใช้ค่า N จาก SPT"
IDS_GEO_DGNCALC_FDN_INTERNAL_FINALBLOW = "การขับเสาเข็มขั้นสุดท้าย"
IDS_GEO_DGNCALC_FDN_INTERNAL_CONCRETEMILK = "การผสมมิลค์ซีเมนต์"
IDS_GEO_DGNCALC_FDN_INTERNAL_CONCRETEPLACING = "การหล่อคอนกรีต"
IDS_GEO_DGNCALC_FDN_STEELPILE_SOFTROCK = "การติดตั้งเสาเข็มท่อเหล็กในหินอ่อน"
IDS_GEO_DGNCALC_FDN_CPT_TIP_RESISTANCE = "การทดสอบการเจาะกรวย"
IDS_GEO_DGNCALC_FDN_SPT_ELSE_UNLIMITE = "SPT และความต้านทานไม่ระบายน้ำ"
IDS_GEO_DGNCALC_FDN_ULTIMATE_BEARING = "ความสามารถรับน้ำหนักสูงสุด"
IDS_GEO_DGNCALC_FDN_CALC_HORIZFACTOR = "โมดูลัสของความยืดหยุ่นในแนวนอน"
IDS_GEO_DGNCALC_FDN_CALC_HORIZ_BEARING = "ความสามารถรับน้ำหนักในแนวนอน"
IDS_GEO_DGNCALC_FDN_CALC_ELASTICFACTOR = "โมดูลัสของความยืดหยุ่นของพื้นดิน"
IDS_GEO_DGNCALC_FDN_DAVISSION_1970 = "ดินเหนียว"
IDS_GEO_DGNCALC_FDN_SOIL_N = "การทดสอบการเจาะมาตรฐาน"
IDS_GEO_DGNCALC_FDN_PILETYPE_BEARING = "การคำนวณกำลังรับน้ำหนักสำหรับเสาเข็มตอก"
IDS_GEO_DGNCALC_FDN_DRILLED_BEARING = "การคำนวณกำลังรับน้ำหนักสำหรับเสาเข็มเจาะหล่อในที่"
IDS_GEO_DGNCALC_FDN_INTERNAL_BEARING = "การคำนวณกำลังรับน้ำหนักของเสาเข็มเจาะ"
IDS_GEO_DGNCALC_FDN_JAPAN_BRIDGE = "มาตรฐานสะพานญี่ปุ่น"
IDS_GEO_DGNCALC_FDN_INFRA_ARCHITECT_2004 = "ข้อกำหนดการออกแบบฐานรากของโครงสร้าง (สมาคมสถาปัตยกรรมญี่ปุ่น, 2004)"
IDS_GEO_DGNCALC_ELASTIC_DIFF = "ทฤษฎีความยืดหยุ่น"
IDS_GEO_DGNCALC_ELASTIC_DIFF1 = "ทฤษฎีความยืดหยุ่น 1"
IDS_GEO_DGNCALC_ELASTIC_DIFF2 = "ทฤษฎีความยืดหยุ่น 2"
IDS_GEO_DGNCALC_CLAY_SAT = "ดินเหนียวที่อิ่มตัว"
IDS_GEO_DGNCALC_STRAIN_EFFECT = "ผลของการยืด"
IDS_GEO_DGNCALC_FDN_TERZAGHI_BEARING = "สมการของ Terzaghi"
IDS_GEO_DGNCALC_FDN_MEYERHOF_BEARING = "สมการของ Meyerhof"
IDS_GEO_DGNCALC_FDN_GENERAL_SHEAR_FAIL = "การล้มเหลวของแรงเฉือนทั่วไป"
IDS_GEO_DGNCALC_FDN_LOCAL_SHEAR_FAIL = "การล้มเหลวของแรงเฉือนเฉพาะที่"
IDS_GEO_DGNCALC_FDN_MODIFY_TERZAGHI = "สมการ Terzaghi ที่ปรับปรุง"
IDS_GEO_DGNCALC_FDN_EXPERIENCE = "ประสบการณ์"
IDS_GEO_DGNCALC_FDN_COMP_STRENGTH = "ความต้านทานการอัดแบบแกนเดียว"
IDS_GEO_DGNCALC_FDN_GOOD_ROCK = "หินดี"
IDS_GEO_DGNCALC_FDN_ROCK_CLASSIFICATION = "การจำแนกประเภทหิน"
IDS_GEO_DGNCALC_FDN_PBT_TERZAGHI_PECK = "Terzaghi et al."
IDS_GEO_DGNCALC_FDN_PBT_BOND = "Bond."
IDS_GEO_DGNCALC_FDN_CANNOT_CALC_BEARING = "ไม่สามารถคำนวณกำลังรับน้ำหนักได้"
IDS_GEO_DGNCALC_FDN_ISNOT_LOAD = "ไม่มีน้ำหนักบรรทุกในแนวดิ่ง"
IDS_GEO_DGNCALC_FDN_MSG_E2B2E1L2 = "ในกรณี e2 ≥ B/2 หรือ e1 ≥ L/2"
IDS_GEO_DGNCALC_FDN_MSG_E2B2ELL2 = "ในกรณี eB ≥ B/2 หรือ eL ≥ L/2"
IDS_GEO_DGNCALC_FDN_MSG_ONLYAXIALFORCE = "ในกรณีที่มีเพียงแรงตามแกนเท่านั้น"
IDS_GEO_DGNCALC_FDN_MSG_ED8 = "ในกรณี e ≤ D/8 (การกระจายแบบสี่เหลี่ยมคางหมู)"
IDS_GEO_DGNCALC_FDN_MSG_ED8_TRIANGLE = "ในกรณี e > D/8 (การกระจายแบบสามเหลี่ยม)"
IDS_GEO_DGNCALC_FDN_MSG_ED2 = "ในกรณี e ≥ D/2"
IDS_GEO_DGNCALC_FDN_MSG_B6 = "ในกรณี ≤ B/6 (การกระจายแบบสี่เหลี่ยมคางหมู)"
IDS_GEO_DGNCALC_FDN_MSG_EB6_TRIANGLE = "ในกรณี e > B/6 (การกระจายแบบสามเหลี่ยม)"
IDS_GEO_DGNCALC_FDN_MSG_EL6 = "ในกรณี e ≤ L/6 (การกระจายแบบสี่เหลี่ยมคางหมู)"
IDS_GEO_DGNCALC_FDN_MSG_EL6_TRIANGLE = "ในกรณี e > L/6 (การกระจายแบบสามเหลี่ยม)"
IDS_GEO_DGNCALC_FDN_MSG_6E2B6E1L = "ในกรณี 6e2/B + 6e1/L ≤ 1.0 (การกระจายแบบสี่เหลี่ยมคางหมู)"
IDS_GEO_DGNCALC_FDN_MSG_6EBB6ELL = "ในกรณี 6eB/B + 6eL/L ≤ 1.0 (การกระจายแบบสี่เหลี่ยมคางหมู)"
IDS_GEO_DGNCALC_FDN_MSG_B6E1L = "ในกรณี /B + 6e1/L > 1.0 (การกระจายแบบสามเหลี่ยม)"
IDS_GEO_DGNCALC_FDN_MSG_B6ELL = "ในกรณี /B + 6eL/L > 1.0 (การกระจายแบบสามเหลี่ยม)"
IDS_DGNCALCBASE_MESH_FAIL = "การสร้าง Mesh ล้มเหลว"
IDS_GEO_DGNCALC_FDN_TIP_BEARING_EQ = "สมการกำลังรับน้ำหนักปลายของเสาเข็มท่อเหล็กที่ตอกฝังในหินอ่อน"
IDS_GEO_DGNCALC_FDN_ROEW_1987 = "Rowe และ Armitage(1987)"
IDS_GEO_DGNCALC_FDN_ZHANG_1998 = "Zhang และ Einstein(1998)"
IDS_GEO_DGNCALC_FDN_CFEM_2006 = "คู่มือวิศวกรรมฐานรากของแคนาดา (2006)"
IDS_GEO_DGNCALC_FDN_SPT_TIP_ULT_BEARING = "กำลังรับน้ำหนักปลายสูงสุดจาก SPT"
IDS_GEO_DGNCALC_FDN_CLAY_PILETYPE_TIP_BEARING = "กำลังรับน้ำหนักปลายของเสาเข็มตอกในดินเหนียว"
IDS_GEO_DGNCALC_FDN_CPT_TIP_BEARING = "กำลังรับน้ำหนักปลายสูงสุดโดย CPT"
IDS_GEO_DGNCALC_FDN_DISTURB_TIP_BEARING = "กำลังรับน้ำหนักปลายจากการรบกวนของดินระหว่างการก่อสร้าง"
IDS_GEO_DGNCALC_FDN_CLAY_DRILLED_TIP_BEARING = "กำลังรับน้ำหนักปลายของเสาเข็มเจาะหล่อในที่ในดินเหนียว"
IDS_GEO_DGNCALC_FDN_TOUMA_1974 = "Touma and Reese (1974), Quiros and Reese (1977)"
IDS_GEO_DGNCALC_FDN_INTERNAL_TIP_ULT_BEARING = "กำลังรับน้ำหนักปลายของเสาเข็มเจาะ (cement milk grouting)"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1956 = "สมการของ Meyerhof (1956)"
IDS_GEO_DGNCALC_FDN_INFRA_ARCHITECT_JAPAN_2004 = "ข้อกำหนดการออกแบบฐานรากของโครงสร้าง (สมาคมสถาปัตยกรรมญี่ปุ่น, 2004)"
IDS_GEO_DGNCALC_FDN_BASE_STANDARD_1997 = "มาตรฐานการออกแบบฐานรากของโครงสร้าง (1997)"
IDS_GEO_DGNCALC_FDN_CGS_1985 = "สมาคมวิศวกรรมธรณีแคนาดา (1985)"
IDS_DGNCALCBASE_CALC_SECT_PROP_FAIL = "การคำนวณคุณสมบัติหน้าตัดล้มเหลว"
IDS_DGNCALCBASE_ERROR_SECT_DATA__s = "เกิดข้อผิดพลาดขณะใช้ไฟล์ข้อมูลหน้าตัด( %s ).\nข้อผิดพลาด :"
IDS_UNIT_LENGTH_MM = "mm"
IDS_UNIT_LENGTH_CM = "cm"
IDS_UNIT_LENGTH_M = "m"
IDS_UNIT_LENGTH_IN = "in"
IDS_UNIT_LENGTH_FT = "ft"
IDS_UNIT_FORCE_KG = "kgf"
IDS_UNIT_FORCE_TON = "tonf"
IDS_UNIT_FORCE_N = "N"
IDS_UNIT_FORCE_KN = "kN"
IDS_UNIT_FORCE_LBF = "lbf"
IDS_UNIT_FORCE_KIP = "kip"
IDS_UNIT_FORCE_KIPs = "kips"
IDS_UNIT_DEGREE = "deg"
